"use strict";

const CHECKER_INDEX = 5;
const ATTR = ["", "火", "水", "木", "光", "影", "-"];
const ROLE = ["", "攻撃", "防御", "補助", "弱体化", "Spd操作", "View獲得", "回復", "特殊", "-"];

const build = (list) => {
  const result = [["#", "種別", "属性", "役割", "名前", "所持"]];
  const hero = [[]];
  const sk = [[]];
  let n = 0;
  let i = 0;
  for(const row of list){
    const [target, type] = row[0] ? [hero, "H"] : [sk, "S"];
    if(row.length === 4){
      n = row.pop();
      while(n >= target.length) target.push([]);
    }
    target[n].push(row);
    row[0] = ATTR.at(row[0] || -1);
    row[1] = ROLE.at(row[1] || -1);
    row.unshift(type);
    row.push({value: false});
  }
  for(const row of hero.concat(sk).flat()){
    row.unshift(`${++i}`);
    result.push(row);
  }
  return result;
};

const source = [
  [4, 5, "ライキ"],
  [5, 3, "クローネ"],
  [3, 5, "ガンメイ"],
  [4, 1, "バレル"],
  [2, 2, "ハロン"],
  [1, 1, "ヴィクトム"],
  [3, 1, "キョウイチ"],
  [1, 4, "フラミー"],
  [5, 1, "トウシュウ"],
  [2, 1, "ハイドール"],
  [4, 3, "ヒトミ"],
  [3, 4, "スバル"],
  [4, 1, "ハックル"],
  [2, 5, "マクラータ"],
  [1, 2, "アルフェッカ"],
  [1, 5, "カラスキ"],
  [2, 4, "ヨシオリ"],
  [3, 3, "オキタカ"],
  [5, 6, "ボレアリス"],
  [4, 6, "ヤスヒコ"],
  [4, 1, "ロイカー"],
  [5, 2, "セラスティウム"],
  [1, 1, "センセチア"],
  [3, 2, "フェイン"],
  [2, 7, "アンナ"],
  [5, 4, "ツネアキ"],
  [5, 5, "エスペディカ"],
  [4, 7, "テオレオール"],
  [1, 1, "ガルボ"],
  [3, 7, "グリゴリー"],
  [1, 6, "ザニア"],
  [2, 1, "ユーハン"],
  [2, 3, "ヨハック"],
  [1, 3, "アスター"],
  [4, 2, "ガンラン"],
  [5, 4, "バルテ"],
  [5, 1, "ベイグル"],
  [3, 6, "ルーディン"],
  [2, 3, "ステリオ"],
  [4, 4, "オービター"],
  [5, 3, "ジョウゼン"],
  [3, 1, "センサク"],
  [2, 2, "バロレイ"],
  [4, 2, "サオトメ"],
  [1, 6, "フーレイ"],
  [2, 6, "ターバック"],
  [5, 5, "ファーデン"],
  [3, 1, "ラスタバン"],
  [4, 3, "コンチェ"],
  [2, 5, "レティクル"],
  
  [0, 0, "アカシ"],
  [0, 0, "モクダイ"],
  [0, 0, "スイ"],
  [0, 0, "フラミー"],
  [0, 0, "ロレン"],
  [0, 0, "ゴロウ"],
  [0, 0, "ハックル"],
  [0, 0, "エクシオ"],
  [0, 0, "カラスキ"],
  [0, 0, "メリデ"],
  [0, 0, "オキタカ"],
  [0, 0, "ヤスヒコ"],
  [0, 0, "ロイカー"],
  [0, 0, "セイイチロウ"],
  [0, 0, "セラスティウム"],
  [0, 0, "センセチア"],
  [0, 0, "フェイン"],
  [0, 0, "ツネアキ"],
  [0, 0, "エスペディカ"],
  [0, 0, "レイジ"],
  [0, 0, "テオレオール"],
  [0, 0, "ガルボ"],
  [0, 0, "グリゴリー"],
  [0, 0, "ザニア"],
  [0, 0, "ユーハン"],
  [0, 0, "ヨハック"],
  [0, 0, "アスター"],
  [0, 0, "ガンラン"],
  [0, 0, "バルテ"],
  [0, 0, "ベイグル"],
  [0, 0, "ルーディン"],
  [0, 0, "ステリオ"],
  [0, 0, "オービター"],
  [0, 0, "ヨウタロウ"],
  [0, 0, "ジョウゼン"],
  [0, 0, "センサク"],
  [0, 0, "バロレイ"],
  [0, 0, "サオトメ"],
  [0, 0, "フーレイ"],
  [0, 0, "ターバック"],
  [0, 0, "ファーデン"],
  [0, 0, "ラスタバン"],
  [0, 0, "コンチェ"],
  [0, 0, "レティクル"],
/*
  [5, 1, "イヴァガ"],
  
  [0, 0, "イヴァガ"],
*/
];
const data = build(source);
